Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Note that 'alphabetic' is determined by the current locale.
es: Nótese que las letras son definidad por el locale actual.

source: This means that in i.e. the default "C" locale, characters such as umlaut-A (Ä) will not be converted.
es: Esto quiere decir que, por ejemplo, en el locale por defecto ("C"), los caracteres como la Ñ no serán convertidos.

source: Example 1. strtolower() example
es: Ejemplo de strtolower()

source: $str = "Mary Had A Little Lamb and She LOVED It So"; $str = strtolower($str); print $str; # Prints mary had a little lamb and she loved it so
es: $cad = "María Tenía Un Corderito al que QUERÍA Mucho"; $cad = strtolower($cad); print $cad; # Visualiza maría tenía un corderito al que querÍa mucho

source: See also strtoupper(), ucfirst(), and ucwords().
es: Vea también strtoupper() y ucfirst().

source: The function expects to be given a string containing an English date format and will try to parse that format into a UNIX timestamp relative to the timestamp given in now, or the current time if none is supplied.
es: La función espera que se le pase una cadena conteniendo una fecha en formato Inglés e intentará procesarla y convertirla a una timestamp (muestra de tiempo) de UNIX relativa a la timestamp proporcionada en ahora, o la hora actual si no se indica ninguna.

source: Upon failure, -1 is returned.
es: Si falla, devolverá -1.

source: Because strtotime() behaves according to GNU date syntax, have a look at the GNU manual page titled Date Input Formats.
es: Dado que strtotime() obra de acuerdo con la sintaxis de fechas de GNU, puede echar un vistazo a la página del manual GNU titulada Date Input Formats (Formatos de entrada de fechas).

source: Described there is valid syntax for the time parameter.
es: La sintaxis descrita ahí es válida para el parátro hora.

source: Example 1. strtotime() examples
es: Ejemplos con strtotime()

source: Checking for failure
es: Comprobando si falla

source: $str = 'Not Good'; if (($timestamp = strtotime($str)) === -1) {echo "The string ($str) is bogus";} else {echo "$str == ". date('l dS of F Y h:i:s A',$timestamp);}
es: $str = 'No v aacute;lida'; if (($timestamp = strtotime($str)) === -1) {echo "La cadena ($str) no es v aacute;lida .";} else {echo "$str == ". date('l dS of F Y h:i:s A',$timestamp);}

source: The valid range of a timestamp is typically from Fri, 13 Dec 1901 20:45:54 GMT to Tue, 19 Jan 2038 03:14:07 GMT. (These are the dates that correspond to the minimum and maximum values for a 32-bit signed integer.)
es: El rango válido de una timestamp suele ser desde Fri, 13 Dec 1901 20:45:54 GMT (Viernes, 13 de diciembre) a Tue, 19 Jan 2038 03:14:07 GMT (Martes, 19 de enero). (Estas son las fechas que corresponden a los valores mínimo y máximo de un entero con signo de 32 bits.)

source: Returns string with all alphabetic characters converted to uppercase.
es: Devuelve la cadena con todas sus letras en mayúsculas.

source: For instance, in the default "C" locale characters such as umlaut-a (ä) will not be converted.
es: Esto quiere decir que, por ejemplo, en el locale por defecto ("C"), los caracteres como la ñ no serán convertidos.

source: Example 1. strtoupper() example
es: Ejemplo de strtoupper()

source: $str = "Mary Had A Little Lamb and She LOVED It So"; $str = strtoupper($str); print $str; # Prints MARY HAD A LITTLE LAMB AND SHE LOVED IT SO
es: $cad = "María Tenía Un Corderito al que QUERÍA Mucho"; $cad = strtoupper ($cad); print $cad; # Visuaiza MARíA TENíA UN CORDERITO AL QUE QUERÍA MUCHO

source: See also strtolower(), ucfirst(), and ucwords().
es: Vea también strtolower() and ucfirst().

source: This function returns a copy of str, translating all occurrences of each character in from to the corresponding character in to and returning the result.
es: Esta función trabaja sobre cad, traduciendo todas las apariciones de cada caracter en desde por el caracter correspondiente en hasta y devolviendo el resultado.

source: If from and to are different lengths, the extra characters in the longer of the two are ignored.
es: Si desde y hasta son de distinta longitud, los caracteres extra en la más larga son ignorados.

source: Example 1. strtr() example
es: Ejemplo de strtr()

source: strtr() can be called with only two arguments.
es: strtr() puede llamarso sólo con dos argumentos.

source: If called with two arguments it behaves in a new way: from then has to be an array that contains string - string pairs that will be replaced in the source string. strtr() will always look for the longest possible match first and will *NOT* try to replace stuff that it has already worked on.
es: Si se llama de esta manera, se comporta de otro modo: desde debe ser entonces una matriz que contenga pares cadena - cadena que serán sustituídos en la cadena fuente. strtr() siempre buscará la coincidencia más larga primero y *NO* intentará sustituir nada en lo que haya trabajado ya.

source: $trans = array( "hello "= "hi", "hi" = "hello"); echo strtr("hi all, I said hello", $trans). "\n";
es: $trad = array ("hola "= "hey", "hey" = "hola"); echo strtr("hey a todos, dije hola", $trad). "\n";

source: This optional to and from parameters were added in PHP 4.0.0
es: Esta característica (2 argumentos) fue añadida en el PHP 4.0

source: See also ereg_replace().
es: Vea también ereg_replace().

source: See the documentation on string for more information on converting to string.
es: Devuelve una cadena con el valor de var.

source: You cannot use strval() on arrays or objects.
es: No se puede usar strval() sobre arrays u objetos.

source: See also floatval(), intval(), settype() and Type juggling.
es: Ver también doubleval(), intval(), settype() y Type juggling.

source: substr_count() returns the number of times the needle substring occurs in the haystack string.
es: substr_count() devuelve el número de veces que la subcadena aguja se encuentra en la cadena pajar.

source: Example 1. substr_count() example
es: Ejemplo 1.

source: ?php print substr_count( "This is a test", "is"); / / prints out 2?
es: Ejemplo de substr_count()

source: See also count_chars(), strpos(), substr(), and strstr().
es: print substr_count( "This is a test", "is"); / / prints out 2

source: substr() returns the portion of string specified by the start and length parameters.
es: substr devuelve la porción de cadena especificada por los parámetros comienzo y largo.

source: For instance, in the string 'abcdef', the character at position 0 is' a ', the character at position 2 is' c ', and so forth.
es: Si comienzo es positivo, la cadena devuelta comenzará en dicho caracter de cadena.

source: Basic substr() usage
es: Ejemplos:

source: If start is negative, the returned string will start at the start 'th character from the end of string.
es: Si comienzo es negativo, la cadena devuelta comenzará en dicha posición desde el final de cadena.

source: Using a negative start
es: Ejemplos:

source: ?php $rest = substr( "abcdef", -1); / / returns "f "$rest = substr("abcdef", -2); / / returns "ef" $rest = substr("abcdef", -3, 1); / / returns "d "?
es: $resto = substr ("abcdef", -1); / / devuelve "f "$resto = substr ("abcdef", -2); / / devuelve "ef" $resto = substr ("abcdef", -3, 1); / / devuelve "d "

source: If string is less than start characters long, FALSE will be returned.
es: Si esto resulta en una cadena con longitud negativa (porque el comienzo está pasado el final de la cadena), la cadena devuelta contendrá únicamente el caracter que haya en comienzo.

source: If length is given and is negative, then that many characters will be omitted from the end of string (after the start position has been calculated when a start is negative).
es: Si se especifica largo y es negativo, la cadena devuelta terminará a largo caracteres desde el final de cadena.

source: If start denotes a position beyond this truncation, an empty string will be returned.
es: Si esto resulta en una cadena con longitud negativa, la cadena devuelta contendrá únicamente el caracter que haya en comienzo.

source: Using a negative length
es: Examples:

source: ?php $rest = substr( "abcdef", 0, -1); / / returns "abcde "$rest = substr("abcdef", 2, -1); / / returns "cde" $rest = substr("abcdef", 4, -4); / / returns "" $rest = substr("abcdef", -3, -1); / / returns "de "?
es: $resto = substr ("abcdef", 1, -1); / / devuelve "bcde "

source: See also strrchr() and ereg().
es: Vea también strrchr() y ereg().

source: substr_replace() replaces a copy of string delimited by the start and (optionally) length parameters with the string given in replacement.
es: substr_replace() sustituye la parte de cadena delimitada por los parámetros comienzo y (opcionalmente) largo por la cadena dada en sustituto.

source: The result is returned.
es: Se devuelve el resultado.

source: If start is positive, the replacing will begin at the start 'th offset into string.
es: Si comienzo es positivo, la sustitución comenzará en dicha posición dentro de la cadena.

source: If start is negative, the replacing will begin at the start 'th character from the end of string.
es: Si comienzo es negativo, la sustitución comenzará en dicha posición pero contando desde el final de cadena.

source: If length is given and is positive, it represents the length of the portion of string which is to be replaced.
es: Si se especifica el largo y es positivo, representa el largo de la porción de cadena a sustituir.

source: If it is negative, it represents the number of characters from the end of string at which to stop replacing.
es: Si es negativo, representa el número de caracteres desde el final de cadena en los que dejar de sustituir.

source: If it is not given, then it will default to strlen( string); i.e. end the replacing at the end of string.
es: Si no se especifica, valdrá por defecto strlen( cadena); es decir, que acabará la sustitución al final de cadena.

source: Example 1. substr_replace() example
es: Ejemplo de substr_replace()

source: ?php $var = 'ABCDEFGH: / MNRPQR /'; echo "Original: $var hr \n"; / * These two examples replace all of $var with'bob'. * / echo substr_replace($var, 'bob', 0). "br \n"; echo substr_replace($var, 'bob', 0, strlen($var))." br \n"; / * Insert'bob 'right at the beginning of $var. * / echo substr_replace($var, 'bob', 0, 0). "br \n"; / * These next two replace'MNRPQR' in $var with'bob'. * / echo substr_replace($var, 'bob', 10, -1)." br \n"; echo substr_replace($var, 'bob', -7, -1). "br \n"; / * Delete'MNRPQR 'from $var. * / echo substr_replace($var, '', 10, -1)." br \n";?
es: ?php $var = 'ABCDEFGH: / MNRPQR /'; echo "Original: $var hr \n"; / * Estos dos ejemplos sustituyen toda $var por 'bob'. * / echo substr_replace ($var, 'bob', 0). "br \n"; echo substr_replace ($var, 'bob', 0, strlen ($var))." br \n"; / * Inserta 'bob 'justo al inicio de $var. * / echo substr_replace ($var, 'bob', 0, 0). "br \n"; / * Los dos siguientes cambian 'MNRPQR' en $var por 'bob'. * / echo substr_replace ($var, 'bob', 10, -1)." br \n"; echo substr_replace ($var, 'bob', -7, -1). "br \n"; / * Borrar 'MNRPQR 'de $var. * / echo substr_replace ($var, '', 10, -1)." br \n";?

source: See also str_replace() and substr().
es: Vea también str_replace() y substr().

source: Among other things, this can be used to implement callbacks, function tables, and so forth.
es: PHP soporta el concepto de funciones variable, esto significa que si una variable tiene unos paréntesis añadidos al final, PHP buscará una función con el mismo nombre que la evaluación de la variable, e intentará ejecutarla.

source: Example 13-3.
es: Entre otras cosas, esto te permite implementar retrollamadas (callbacks), tablas de funciones y demás.

source: You can also call an object 's method by using the variable functions feature.
es: Ejemplo 13-1.

source: Variable method example
es: Ejemplo de función variable

source: See also call_user_func(), variable variables and function_exists().
es: ?php function foo() {echo "Dentro de foo() br \n";} function bar ($arg = '') {echo "Dentro de bar(); el parámetro fue '$arg'. br \n";} $func = 'foo'; $func(); $func = 'bar'; $func ('test ');?

source: Classes and Objects
es: Clases y Objetos

source: Example 1. swfaction() example
es: Ejemplo 1. swfaction() example

source: Example 2. swfaction() example
es: Ejemplo 2. swfaction() example

source: Example 3. swfaction() example
es: Ejemplo 3. swfaction() example

source: Example 4. swfaction() example
es: Ejemplo 4. swfaction() example

source: swf_actionplay
es: Siguiente

source: Example 1. swf_addbuttonrecord() function example
es: Ejemplo 1. swf_addbuttonrecord() function example

source: Example 2. swfbitmap() example
es: Ejemplo 2. swfbitmap() example

source: Example 1. swfbutton() example
es: Ejemplo 1. swfbutton() example

source: Example 2. swfbutton - addaction() example
es: Ejemplo 2. swfbutton - addaction() example

source: Example 1. swfdisplayitem - multcolor() example
es: Ejemplo 1. swfdisplayitem - multcolor() example

source: Example 1. swfdisplayitem - rotateto() example
es: Ejemplo 1. swfdisplayitem - rotateto() example

source: Example 1. swfdisplayitem - setname() example
es: Ejemplo 1. swfdisplayitem - setname() example

source: Example 1. swfgradient() example
es: Ejemplo 1. swfgradient() example

source: Example 1. swfmorph() example
es: Ejemplo 1. swfmorph() example

source: Example 1. swfmovie - streammp3() example
es: Ejemplo 1. swfmovie - streammp3() example

source: The swf_ortho() function defines a orthographic mapping of user coordinates onto the current viewport.
es: The swf_ortho() funcion defines a orthographic mapping of user coordinates onto the current viewport.

source: Example 1. swfshape - addfill() example
es: Ejemplo 1. swfshape - addfill() example

source: The swf_shapecurveto() function draws a quadratic bezier curve from the current location, though the x coordinate given by x1 and the y coordinate given by y1 to the x coordinate given by x2 and the y coordinate given by y2.
es: The swf_shapecurveto() function draws a quadratic bezier curve from the x coordinate given by x1 and the y coordinate given by y1 to the x coordinate given by x2 and the y coordinate given by y2.

source: Example 1. swfshape() example
es: Ejemplo 1. swfshape() example

source: Example 1. swfshape - setline() example
es: Ejemplo 1. swfshape - setline() example

source: Example 1. swfsprite() example
es: Ejemplo 1. swfsprite() example

source: Example 1. swftext() example
es: Ejemplo 1. swftext() example

source: The number of affected rows by the last query.
es: El número de filas afectadas por la última consulta.

source: sybase_affected_rows() returns the number of rows affected by the last INSERT, UPDATE or DELETE query on the server associated with the specified link identifier.
es: sybase_affected_rows() devuelve el número de filas afectadas por la última acción e tipo INSERT, UPDATE o DELETE en el servidor asociado al identificador de enlace especificado.

source: This command is not effective for SELECT statements, only on statements which modify records.
es: Esta instrucción no es efectiva para sentencias de tipo SELECT, sólo en sentencias que modifican registros.

source: To retrieve the number of rows returned from a SELECT, use sybase_num_rows().
es: Para obtener el número de filas afectadas por un SELECT, use sybase_num_rows().

source: This function is only available using the CT library interface to Sybase, and not the DB library.
es: Esta función sólo esta disponible usando el interface de la librería CT, y no con la librería DB.

source: Sybase functions
es: Funciones de Sybase

source: sybase_close() closes the link to a Sybase database that's associated with the specified link identifier.
es: sybase_close() cierra el enlace a la base de datos Sybase asociada con el identificador de enlace especificado.

source: sybase_close() will not close persistent links generated by sybase_pconnect().
es: sybase_close() no cerrará enlaces persistentes generados por sybase_pconnect().

source: See also: sybase_connect(), sybase_pconnect().
es: Vea también: sybase_connect(), sybase_pconnect().

source: A positive Sybase link identifier on success, or FALSE on error.
es: Un identificador de enlace Sybase positivo, o FALSE ante un error.

source: sybase_connect() establishes a connection to a Sybase server.
es: sybase_connect() establece una conexión son un servidor Sybase.

source: In case a second call is made to sybase_connect() with the same arguments, no new link will be established, but instead, the link identifier of the already opened link will be returned.
es: En el caso que se haga una segunda llamada a sybase_connect() con los mismos argumentos, no se establecerá un nuevo enlace, en vez de esto, se devolverá el identificador de enlace que ya está abierto.

source: The link to the server will be closed as soon as the execution of the script ends, unless it' s closed earlier by explicitly calling sybase_close().
es: El enlace al servidor será cerrado tan pronto como la ejecución del script finalice, a menos que sea cerrado antes llamando explicitamente a sybase_close().

source: See also sybase_pconnect(), sybase_close().
es: Vea también sybase_pconnect(), sybase_close().

source: TRUE on success, FALSE on failure
es: TRUE si lo hace, FALSE en caso de fallo

source: sybase_data_seek() moves the internal row pointer of the Sybase result associated with the specified result identifier to pointer to the specifyed row number.
es: sybase_data_seek() mueve el puntero interno de la fila del resultado asociado con el identificador de resultado especificado hacia el número de fila introducido.

source: The next call to sybase_fetch_row() would return that row.
es: La siguiente llamada a sybase_fetch_row() devolverá esa fila.

source: See also: sybase_data_seek().
es: Vea también: sybase_data_seek().

source: sybase_fetch_array() is an extended version of sybase_fetch_row().
es: sybase_fetch_array() es la versión extendida de sybase_fetch_row().

source: An important thing to note is that using sybase_fetch_array() is NOT significantly slower than using sybase_fetch_row(), while it provides a significant added value.
es: Una cosa importante a remarcar es que el uso de sybase_fetch_array() NO es significativamente más lento que el uso de sybase_fetch_row(), mientrás que proporciona un valor añadido significativo.

source: For further details, also see sybase_fetch_row().
es: Para más detalles, vea también sybase_fetch_row()

source: sybase_fetch_field() can be used in order to obtain information about fields in a certain query result.
es: sybase_fetch_field() puede usarse para obtener información sobre los campos de una consulta determinada.

source: If the field offset isn' t specified, the next field that wasn't yet retreived by sybase_fetch_field() is retreived.
es: Si no se especifica el offset del campo, el siguiente campo que aún no halla sido tomado por sybase_fetch_field() es el que se obtiene.

source: See also sybase_field_seek()
es: Vea también sybase_field_seek()

source: sybase_fetch_object() is similar to sybase_fetch_array(), with one difference - an object is returned, instead of an array.
es: sybase_fetch_object() es similar a sybase_fetch_array(), con una diferencia - se devuelve un objeto, en vez de un array.

source: Speed-wise, the function is identical to sybase_fetch_array(), and almost as quick as sybase_fetch_row() (the difference is insignificant).
es: En el tema de velocidad, la función es idéntica a sybase_fetch_array(), y al menos tan rápida como sybase_fetch_row() (la diferencia es insignificante).

source: See also: sybase_fetch_array() and sybase_fetch_row().
es: Vea también: sybase_fetch-array() y sybase_fetch-row().

source: sybase_fetch_row() fetches one row of data from the result associated with the specified result identifier.
es: sybase_fetch_row() obtiene una fila de datos del resultado asociado con el identificador de resultado especificado.

source: Subsequent call to sybase_fetch_row() would return the next row in the result set, or FALSE if there are no more rows.
es: Las siguientes llamadas a sybase_fetch_rows() devolverán la siguiente fila del conjunto de resultados, o FALSE si no hay más filas.

source: See also: sybase_fetch_array(), sybase_fetch_object(), sybase_data_seek(), sybase_fetch_lengths(), and sybase_result().
es: Vea también: sybase_fetch_array(), sybase_fetch_object(), sybase_data_seek(), sybase_fetch_lengths(), y sybase_result().

source: If the next call to sybase_fetch_field() won't include a field offset, this field would be returned.
es: Si la siguiente llamada sybase_fetch_field() no incluye un offset se devuelve este campo.

source: See also: sybase_fetch_field().
es: Vea también: sybase_fetch_field().

source: sybase_free_result() only needs to be called if you are worried about using too much memory while your script is running.
es: sybase_free_result() sólo se necesita usar en el caso de que este preocupado por el uso de demasiada memoria mientras se ejecuta su script.

source: You may call sybase_free_result() with the result identifier as an argument and the associated result memory will be freed.
es: Todos los resultados en memoria son liberados cuando el script finaliza, puede llamar a sybase_free_result() con el identificador de resultado como argumento y la memoria asociada a ese resultado será liberada.

source: sybase_num_fields() returns the number of fields in a result set.
es: sybase_num_fields() devuelve el número de campos en un conjunto de resultados.

source: See also: sybase_db_query(), sybase_query(), sybase_fetch_field(), sybase_num_rows().
es: Vea también: sybase_db_query(), sybase_query(), sybase_fetch_field(), sybase_num_rows().

source: sybase_num_rows() returns the number of rows in a result set.
es: sybase_num_rows() devuelve el número de filas de un conjunto de resultados.

source: See also: sybase_db_query(), sybase_query() and, sybase_fetch_row().
es: Vea también: sybase_db_query(), sybase_query() and, sybase_fetch_row().

source: A positive Sybase persistent link identifier on success, or FALSE on error
es: Un identificador de enlace persistente de Sybase positivo en caso de que pueda abrirlo, en caso de error devuelve FALSE

source: sybase_pconnect() acts very much like sybase_connect() with two major differences.
es: sybase_pconnect() actua de una forma muy parecida a sybase_connect() con dos grandes diferencias.

source: Instead, the link will remain open for future use (sybase_close() will not close links established by sybase_pconnect()()).
es: En vez de esto, el enlace permanecerá abierto para un futuro uso (sybase_close() no podrá cerrar enlaces establecidos con sybase_pconnect()).

source: A positive Sybase result identifier on success, or FALSE on error.
es: Un identificador de resultado Sybase positivo si va bien, o FALSE ante un error.

source: sybase_query() sends a query to the currently active database on the server that's associated with the specified link identifier.
es: sybase_query() envía una consulta a la actual base de datos activa en el servidor que está asociada con el identificador de enlace especificado.

source: If no link is open, the function tries to establish a link as if sybase_connect() was called, and use it.
es: Si no hay un enlace abierto, la función intentará establecer un enlace como si sybase_connect() fuese llamada, y lo usará.

source: See also: sybase_db_query(), sybase_select_db(), and sybase_connect().
es: Vea también: sybase_db_query(), sybase_select_db(), y sybase_connect().

source: The contents of the cell at the row and offset in the specified Sybase result set.
es: El contenido de la celda en la fila y el offset especificado de un conjunto de resultados de Sybase.
